# Dicionário e listas fornecidos
d = {
    "ana": [17, 2, {123: [9, 5, 7]}],
    "bia": [15, 0, {321: [4, 8, 9]}],
    "eva": [19, 7, {213: [3, 2, 13]}]
}

lis = [0, [1, 2, [12, 13, 14], {"12": [9, 8, 7], "16": [11,12,13]}], 23]
lis2 = [16, 27, [2, [3, 6, 7], 17], 9, 23]

# Operações intermediárias
a = lis2[2][1][1] + d["bia"][0]  # lis2[2][1][1] é 6, d["bia"][0] é 15, então a = 6 + 15 = 21
k = lis2[2][1][1] + lis[1][3]["12"][1]  # lis2[2][1][1] é 6, lis[1][3]["12"][1] é 8, então k = 6 + 8 = 14

# Impressões
print(d["eva"][0])  # d["eva"][0] é 19
print(d["bia"][2][321][2])  # d["bia"][2][321][2] é 9
print(d["ana"][2][123])  # d["ana"][2][123] é [9, 5, 7]

print(lis[2])  # lis[2] é 23
print(lis[1])
print(lis[1][2])  # lis[1][2] é [12, 13, 14]
print(lis[1][2][1])  # lis[1][2][1] é 13
print(lis[1][3]["16"])  # lis[1][3]["16"] é [11, 12, 13]
print(lis[1][3]["12"][2])  # lis[1][3]["12"][2] é 7

print(lis2[1])  # lis2[1] é 27
print(lis2[2])  # lis2[2] é [2, [3, 6, 7], 17]
print(lis2[2][1])  # lis2[2][1] é [3, 6, 7]
print(lis2[2][1][2])  # lis2[2][1][2] é 7

print(f"{lis2[1]} + {d['bia'][0]} = {a}")  # lis2[1] é 27, d["bia"][0] é 15, a é 21
print(f"{lis2[2][1][1]} + {lis[1][3]['12'][1]} = {k}")  # lis2[2][1][1] é 6, lis[1][3]["12"][1] é 8, k é 14